benchmarks/ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /
Document Length:        31425 bytes

Concurrency Level:      100
Time taken for tests:   27.000 seconds
Complete requests:      1000
Failed requests:        3
   (Connect: 0, Receive: 0, Length: 3, Exceptions: 0)
Total transferred:      32512150 bytes
HTML transferred:       31425150 bytes
Requests per second:    37.04 [#/sec] (mean)
Time per request:       2699.958 [ms] (mean)
Time per request:       27.000 [ms] (mean, across all concurrent requests)
Transfer rate:          1175.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       3
Processing:    22 2336 428.9   2432    2625
Waiting:       20 2334 428.9   2430    2623
Total:         24 2336 428.3   2432    2625

Percentage of the requests served within a certain time (ms)
  50%   2432
  66%   2479
  75%   2498
  80%   2513
  90%   2541
  95%   2563
  98%   2600
  99%   2608
 100%   2625 (longest request)